In [13]:
import pandas as pd
#1
one = pd.Series({'year':'2014', 'name':'bob', 'point': 1.5})
two = pd.Series({'year':'2015', 'name':'tom', 'point': 1.7})
three = pd.Series({'year':'2015', 'name':'kim', 'point': 3.6})
four = pd.Series({'year':'2018', 'name':'lee', 'point': 1.5})
five = pd.Series({'year':'2020', 'name':'park', 'point': 2.4})

group = pd.DataFrame([one, two, three, four, five], index = ['one', 'two', 'three', 'four', 'five'])
group

       year  name  point
one    2014   bob    1.5
two    2015   tom    1.7
three  2015   kim    3.6
four   2018   lee    1.5
five   2020  park    2.4

In [15]:
group[['year', 'name']]

one      2014
two      2015
three    2015
four     2018
five     2020
Name: year, dtype: object

In [3]:
#2
Korea = pd.Series({'경기수':'14', '금메달':0, '은메달': 1, '동메달':2})
USA = pd.Series({'경기수':'25', '금메달':5, '은메달': 3, '동메달':8})
China = pd.Series({'경기수':'18', '금메달':1, '은메달': 5, '동메달':3})
Japan = pd.Series({'경기수':'15', '금메달':7, '은메달': 1, '동메달':3})
Canada = pd.Series({'경기수':'32', '금메달':8, '은메달': 2, '동메달':6})

group = pd.DataFrame([Korea, USA, China, Japan, Canada], index = ['Korea', 'USA', 'China', 'Japan', 'Canada'])
group

       경기수  금메달  은메달  동메달
Korea   14    0    1    2
USA     25    5    3    8
China   18    1    5    3
Japan   15    7    1    3
Canada  32    8    2    6

In [4]:
group.sort_values(by='금메달', ascending=True)[-3:]

       경기수  금메달  은메달  동메달
USA     25    5    3    8
Japan   15    7    1    3
Canada  32    8    2    6

In [5]:
#3
import pandas as pd
one = pd.Series({'name':'bob', 'age':20, 'score': 90})
two = pd.Series({'name':'tom', 'age':15, 'score': 80})
three = pd.Series({'name':'kim', 'age':27, 'score': 70})
four = pd.Series({'name':'lee', 'age':11, 'score': 95})
five = pd.Series({'name':'park', 'age':30, 'score': 30})

df1 = pd.DataFrame([one, two, three, four, five], index = ['one', 'two', 'three', 'four', 'five'])
df1.iloc[::2]

       name  age  score
one     bob   20     90
three   kim   27     70
five   park   30     30

In [6]:
df1.loc[['two', 'four']]
#loc는 string index로 명시

     name  age  score
two   tom   15     80
four  lee   11     95

In [ ]:
#4
tripleDF = pd.read_csv('Ontology_CSV.csv', sep=',', names=['subject', 'predicate', 'object'])
randomTripleDF = tripleDF.sample(frac=1)
randomTripleDF.head()

In [ ]:
#5
subClassOfDF = randomTripleDF[randomTripleDF['predicate']=='subClassOf']
subClassOfDF.head()

In [ ]:
#6
del subClassOfDF['object']
subClassOfDF